app/controllers/documents_controller.rb

SELECT "documents".* FROM "documents" WHERE "documents"."share_token" = 'c61f4cf04d' LIMIT 1
---
  def public_show
    @document = Document.find_by!(share_token: params[:share_token])