app/controllers/documents_controller.rb

INSERT INTO "documents" ("user_id", "title", "description", "file", "created_at", "updated_at") VALUES (1, 'first file', 'this is the first file', NULL, '2025-08-14 19:50:12.170429', '2025-08-14 19:50:12.170429') RETURNING "id"
---
  def create
    @document = current_user.documents.build(document_params)

    if @document.save

DELETE FROM "documents" WHERE "documents"."id" = 1
---
  def destroy
    @document.destroy

SELECT "documents".* FROM "documents" WHERE "documents"."user_id" = 1 AND "documents"."id" = NULL LIMIT 1
---
  def set_document
    @document = current_user.documents.find(params[:id])